finalProject/results/test/test_height/box05/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0] 5000;

internalField   uniform (1 0 0);

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue    constant (1 0 0);
        value           uniform (1 0 0);
    }
    bottom
    {
        type            fixedValue;
        value           $internalField;
    }
    frontAndBack
    {
        type            empty;
    }
    top
    {
        type            slip;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (1 0 0);
    }
    car
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
